emacs/config.org
#+PROPERTY: header-args :tangle no :noweb yes :results no :eval no :comments noweb
#+TITLE: Tor's init

* Overview
I've made many attempts at structuring my Emacs configuration, so why not try once more.

Mistakes from the past:
1. Not descriptive enough comments with each package to know how to set it up properly.
   - Need to provide more context.
2. For a while we didn't use =straight.el=, but now we are so we should make use of everything it provides.
   - For example, we should use =straight-freeze-versions=.
3. Having an =init.el= file in addition to a =init.org= is too god-damn tempting!
   - When messing around with something, it's just too easy to mess around with `=init.el= instead of =init.org=.
   - One easy fix is to just remove the usage of =init.el= "completely", i.e. we use something like =(org-babel-load-file ...)= to evaluate the =init.org= (which then generates the =init.el=)
     - Good example: https://emacs.stackexchange.com/a/3147
   - So what we're going to do is that we'll include a /slightly/ customized version of =org-babel-load-file= for which we can specify which file to tangle to.
     - Allows us to define the full configs by specifying two different blocks:
       - =init-minimal.el=: defines a minimalist config which can be useful in scenarios where I don't need all the bells and whistles, e.g. if I want to do some remote editing through thet terminal.
       - =init-full.el=: the full init file I use on my personal devices.
 
So. The strategy will be as follows.
1. Different topics / packages get their own section.
2. Every src-block should have a unique name.
3. In the end, each "full" config should have it's ownn src-block where we use =:noweb yes= to include other src-blocks + =:comments noweb= so we can get a sense of where things came from by looking at the resulting =init.el= file.
4. We create a =Makefile= which does all the necessary stuff on a new installation, i.e.:
   1. Run =emacs= to tangle the file.
   2. Link the files we want linked, e.g. snippets.

Some other significant changes:
1. Replace the beloved =helm= with =vertico= + =marginalia= + =consult= + =embark=.
2. Repalce =org-ref= with =citar= and =org-cite.el=.

* Loading the config
As mentioned in the overview, we're going to take the following approach in main init file:
#+begin_src emacs-lisp :tangle init.el
(require 'org)

;; A copy-paste from https://github.com/bzg/org-mode/blob/bd468136dd1a2172302b3ec980c5e6b6e327d683/lisp/org.el#L249-L279
;; but with the option of specifying the tangled file `file-out'.
;; Note that if blocks have specified a `:tangle' header, only those matching `file-out'
;; will indeed be tangled.'
(defun my/org-babel-load-file (file &optional file-out compile)
  "Load Emacs Lisp source code blocks in the Org FILE to FILE-OUT.
This function exports the source code using `org-babel-tangle'
and then loads the resulting file using `load-file'.  With
optional prefix argument COMPILE, the tangled Emacs Lisp file is
byte-compiled before it is loaded."
  (interactive "fFile to load: \nP")
  (let ((tangled-file (if file-out file-out (concat (file-name-sans-extension file) ".el"))))
    ;; Tangle only if the Elisp file is older than the Org file.
    ;; Catch the case when the .el file exists while the .org file is missing.
    (unless (file-exists-p file)
      (error "File to tangle does not exist: %s" file))
    (when (file-newer-than-file-p file tangled-file)
      (org-babel-tangle-file file
                             tangled-file
                             (rx string-start
                                 (or "emacs-lisp" "elisp")
                                 string-end))
      ;; Make sure that tangled file modification time is
      ;; updated even when `org-babel-tangle-file' does not make changes.
      ;; This avoids re-tangling changed FILE where the changes did
      ;; not affect the tangled code.
      (when (file-exists-p tangled-file)
        (set-file-times tangled-file)))
    (if compile
	    (progn
	      (byte-compile-file tangled-file)
	      (load-file (byte-compile-dest-file tangled-file))
	      (message "Compiled and loaded %s" tangled-file))
      (load-file tangled-file)
      (message "Loaded %s" tangled-file))))

;; Actually load the file we're interested in.
(my/org-babel-load-file
 (expand-file-name "config.org" user-emacs-directory)    ;; <= this file
 (expand-file-name "init-full.el" user-emacs-directory)) ;; <= the tangled file
#+end_src

If we instead wanted to load the minimalist file, we would just replace the last part in the above by

#+begin_src emacs-lisp
;; Actually load the file we're interested in.
(my/org-babel-load-file
 (expand-file-name "config.org" user-emacs-directory)       ;; <= this file
 (expand-file-name "init-minimal.el" user-emacs-directory)) ;; <= the tangled file
#+end_src

* Package management: =straight.el= and =use-package=
#+name: pkg-management
#+begin_src emacs-lisp
;; straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(defun my/straight-installed-p (package)
  "Check if PACKAGE is installed (according to `straight.el')."
  (straight--installed-and-buildable-p
   ;; `format' allows us to handle both strings and symbols.
   (gethash (format "%s" package) straight--recipe-cache)))

;; use-package.el: Makes configuring the packages much easier.
(straight-use-package 'use-package)

;; Use `straight.el` by default when calling `use-package`.
(setq straight-use-package-by-default t)

;; Allow us to "require" system packages to be present using `:ensure-system-package'
;; in `use-package' blocks.
(use-package use-package-ensure-system-package)
#+end_src

* General utilities
** Basic variables
#+name: basics--variables
#+begin_src emacs-lisp 
;; Customize user interface.
(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)

(setq inhibit-startup-screen t)
(column-number-mode)

;; Don't show trailing whitespace _always_. It's annoying.
(setq-default show-trailing-whitespace nil)
(setq-default indicate-empty-lines t)
(setq-default indicate-buffer-boundaries 'left)

;; Consider a period followed by a single space to be end of sentence.
(setq sentence-end-double-space nil)

;; Use spaces, not tabs, for indentation.
(setq-default indent-tabs-mode nil)

;; Display the distance between two tab stops as 4 characters wide.
(setq-default tab-width 4)

;; Indentation setting for various languages.
(setq c-basic-offset 4)
(setq js-indent-level 2)
(setq css-indent-offset 2)

;; Highlight matching pairs of parentheses.
(setq show-paren-delay 0)
(show-paren-mode)

;; Move the point to bottom/top when using `C-v' and `M-v', respectively,
;; rather than just trying to scroll.
(setq scroll-error-top-bottom t)

;; Disable blinking cursor.
(setq-default visible-cursor nil)
;; (blink-cursor-mode 0) ;; Should be unnecessary on Emacs >24?
#+end_src

** Utility functions
#+name: basics--utility-functions
#+begin_src emacs-lisp
(defun not-nil-p (x)
  "Return `t` if X is not nil."
  (not (not x)))
#+end_src

** Make =format-time-string= consistent across OS time settings
#+name: basics--format-time-string-consistency
#+begin_src emacs-lisp
;; Ensures that we're always going to format the string according to EN locale.
;; Setting `system-time-locale' to `"C"' or something doesn't work for daemon-mode.
;; This is copy-paste from https://kisaragi-hiu.com/blog/2019-10-09-format-time-string-today.html.
(require 'calendar)
(defun kisaragi/english-dow (&optional time zone abbreviated)
  "Return ABBREVIATED name of the day of week at TIME and ZONE.

If TIME or ZONE is nil, use `current-time' or `current-time-zone'."
  (unless time (setq time (current-time)))
  (unless zone (setq zone (current-time-zone)))
  (calendar-day-name
   (pcase-let ((`(,_ ,_ ,_ ,d ,m ,y . ,_)
                (decode-time time zone)))
     (list m d y))
   abbreviated))

(defun kisaragi/advice-format-time-string (func format &optional time zone)
  "Pass FORMAT, TIME, and ZONE to FUNC.

Replace \"%A\" in FORMAT with English day of week of today,
\"%a\" with the abbreviated version."
  (let* ((format (replace-regexp-in-string "%a" (kisaragi/english-dow time zone t)
                                           format))
         (format (replace-regexp-in-string "%A" (kisaragi/english-dow time zone nil)
                                           format)))
    (funcall func format time zone)))


(advice-add 'format-time-string :around #'kisaragi/advice-format-time-string)
#+end_src

** File backup
#+name: basics--file-backup
#+begin_src emacs-lisp
;; Write auto-saves and backups to separate directory.
(make-directory "~/.emacs.d/file-backups/auto-save/" t)
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/file-backups/auto-save/" t)))
(setq backup-directory-alist '(("." . "~/.emacs.d/file-backups/backup/")))

;; Do not move the current file while creating backup.
(setq backup-by-copying t)

;; Disable lockfiles.
(setq create-lockfiles nil)
#+end_src

** Custom settings in seperate file
Let's keep the customization of, well, customizable variables in a separate file so as to avoid it cluttering the =init.el=.

#+name: basics--custom-file
#+begin_src emacs-lisp
;; Write customizations to a separate file instead of this file.
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file t)
#+end_src

** Result
#+name: basics
#+begin_src emacs-lisp 
<<basics--variables>>
<<basics--utility-functions>>
<<basics--format-time-string-consistency>>
<<basics--file-backup>>
<<basics--custom-file>>
#+end_src

* OS specific setup

** Linux
#+name: os-specifics--linux
#+begin_src emacs-lisp
;; Linux
(defmacro when-linux (body)
  "Evaluate BODY if the system type is `gnu/linux'."
  `(when (eq system-type 'gnu/linux)
     ,body))

(when-linux
  ;; NOTE: this will also be hit in WSL.
  (use-package exec-path-from-shell)
  (exec-path-from-shell-initialize)

  ;; use xclip to yank, allowing you to yank in terminal to the GLOBAL clipboard
  (use-package xclip
    :init (xclip-mode)))
#+end_src

** Windows Linux Subsystem
#+name: os-specifics--wsl-copy
#+begin_src emacs-lisp
(defun tor/is-wsl-p ()
  ;; WSL: WSL1 has "-Microsoft", WSL2 has "-microsoft-standard"
  (not-nil (string-match "-[Mm]icrosoft" operating-system-release)))

(defmacro when-wsl (body)
  "Evaluate BODY if running in WSL."
  `(when (tor/is-wsl-p)
     ,body))

(when-wsl
  ;; Source: https://www.emacswiki.org/emacs/Emacs_and_the_Windows_Subsystem_for_Linux
  (defun wsl-copy-region-to-clipboard (start end)
    "Copy region to Windows clipboard."
    (interactive "r")
    (call-process-region start end "clip.exe" nil 0))

  (defun wsl-clipboard-to-string ()
    "Return Windows clipboard as string."
    (let ((coding-system-for-read 'dos))
      (substring				; remove added trailing \n
       (shell-command-to-string
        "powershell.exe -Command Get-Clipboard") 0 -1)))

  (defun wsl-paste-from-clipboard (arg)
    "Insert Windows clipboard at point. With prefix ARG, also add to kill-ring"
    (interactive "P")
    (let ((clip (wsl-clipboard-to-string)))
      (insert clip)
      (if arg (kill-new clip)))))
#+end_src

** Result
#+name: os-specifics
#+begin_src emacs-lisp 
<<basics--linux-specific>>
<<basics--wsl-specific>>
#+end_src



* =~/.authinfo=
- Effectively a very simple plain-text password manager with encryption (if used right)
- Nicely supported in Emacs
  - Also comes with Python bindings (though py3 requires a bit of fiddling)

** Python 3
- Can be useful for other integrations, e.g. I'm already sending emails using Emacs so if I write a Python script, it's nice if I can also just use the auth-information already present in my =~/.authinfo=
- Requires building =authinfo= from scratch
  - Also requires a particular fork: https://github.com/torfjelde/authinfo
- A simple =make install= copies the python package into =/usr/local/lib/python3.8/site-packages= which, unfortunately, isn't loaded (unless you're running the global python interpreter, which is rare these days).
  - A simple fix: =mv= the above to =/usr/local/lib/python3.8/dist-packages= which is loaded by every python installation (this is consider the /global/ repository for packages)
- Possible error: missing shared library =libauthinfo.so.0=
  - The =libauthinfo.so.0= file /should/ be present in =/usr/local/lib= or something equivalent (look for =libauthinfo.so.0= in the output for of the =make install=).
  - So this can be fixed by making sure that Python is indeed looking for shared libraries there, f.ex. by running =export LD_LIBRARY_PATH=/usr/local/lib:$LD_LIBRARY_PATH=.
- Also a useful resource if needed: https://www.masteringemacs.org/article/keeping-secrets-in-emacs-gnupg-auth-sources

* Programming
